;=== MC程序版本 ===
[MC]
;// 版本号_当前
CURRENT_VERSION_NO =1
;// 批次号_当前      
CURRENT_BATCH_NO   =0  
;// 厂商ID_当前           
CURRENT_COMPANY_ID =17 
;// 生效日期_当前           
CURRENT_START_DATE =20181010
;// 版本类型_当前    
CURRENT_VERSION_TYPE =0    

;// 版本号_将来
FUTURE_VERSION_NO =-1 
;// 批次号_将来      
FUTURE_BATCH_NO   =0  
;// 厂商ID_将来           
FUTURE_COMPANY_ID =17 
;// 生效日期_将来           
FUTURE_START_DATE =00000000  
;// 版本类型_将来    
FUTURE_VERSION_TYPE =1   

;=== 发卡模块主控程序版本 ===
[CARD_MODULE_MAIN]
;// 版本号_当前
CURRENT_VERSION_NO =4294967295  
;// 批次号_当前      
CURRENT_BATCH_NO   = 0 
;// 厂商ID_当前           
CURRENT_COMPANY_ID = 0 
;// 生效日期_当前           
CURRENT_START_DATE = 00000000  
;// 版本类型_当前    
CURRENT_VERSION_TYPE = 0    

;// 版本号_将来
FUTURE_VERSION_NO = 4294967295
;// 批次号_将来      
FUTURE_BATCH_NO   = 0  
;// 厂商ID_将来           
FUTURE_COMPANY_ID = 0 
;// 生效日期_将来           
FUTURE_START_DATE = 00000000  
;// 版本类型_将来    
FUTURE_VERSION_TYPE = 1   
 
;=== 发卡模块应用程序版本 ===
[CARD_MODULE_APP]
;// 版本号_当前
CURRENT_VERSION_NO =316
;// 批次号_当前      
CURRENT_BATCH_NO   = 0  
;// 厂商ID_当前           
CURRENT_COMPANY_ID = 0 
;// 生效日期_当前           
CURRENT_START_DATE = 00000000  
;// 版本类型_当前    
CURRENT_VERSION_TYPE = 0   

;// 版本号_将来
FUTURE_VERSION_NO = 4294967295
;// 批次号_将来      
FUTURE_BATCH_NO   = 0  
;// 厂商ID_将来           
FUTURE_COMPANY_ID = 0 
;// 生效日期_将来           
FUTURE_START_DATE = 00000000  
;// 版本类型_将来    
FUTURE_VERSION_TYPE = 1   

;=== TOKEN模块主控程序版本 ===
[TOKEN_MODUL_MAIN]
;// 版本号_当前
CURRENT_VERSION_NO =4294967295  
;// 批次号_当前      
CURRENT_BATCH_NO   = 0 
;// 厂商ID_当前           
CURRENT_COMPANY_ID = 0 
;// 生效日期_当前           
CURRENT_START_DATE = 00000000  
;// 版本类型_当前    
CURRENT_VERSION_TYPE = 0    

;// 版本号_将来
FUTURE_VERSION_NO = 4294967295
;// 批次号_将来      
FUTURE_BATCH_NO   = 0  
;// 厂商ID_将来           
FUTURE_COMPANY_ID = 0 
;// 生效日期_将来           
FUTURE_START_DATE = 00000000  
;// 版本类型_将来    
FUTURE_VERSION_TYPE = 1   
 
;=== TOKEN模块应用程序版本 ===
[TOKEN_MODULE_APP]
;// 版本号_当前
CURRENT_VERSION_NO =4294967295  
;// 批次号_当前      
CURRENT_BATCH_NO   = 0  
;// 厂商ID_当前           
CURRENT_COMPANY_ID = 0 
;// 生效日期_当前           
CURRENT_START_DATE = 00000000  
;// 版本类型_当前    
CURRENT_VERSION_TYPE = 0   

;// 版本号_将来
FUTURE_VERSION_NO = 4294967295
;// 批次号_将来      
FUTURE_BATCH_NO   = 0  
;// 厂商ID_将来           
FUTURE_COMPANY_ID = 0 
;// 生效日期_将来           
FUTURE_START_DATE = 00000000  
;// 版本类型_将来    
FUTURE_VERSION_TYPE = 1   

;=== 充值读写器应用程序版本 ===
[RECHARGE_RW_APP]
;// 版本号_当前
CURRENT_VERSION_NO =0
;// 批次号_当前      
CURRENT_BATCH_NO   =0  
;// 厂商ID_当前           
CURRENT_COMPANY_ID =17
;// 生效日期_当前           
CURRENT_START_DATE =20141207  
;// 版本类型_当前    
CURRENT_VERSION_TYPE =0    

;// 版本号_将来
FUTURE_VERSION_NO = 4294967295
;// 批次号_将来      
FUTURE_BATCH_NO   = 0  
;// 厂商ID_将来           
FUTURE_COMPANY_ID = 17 
;// 生效日期_将来           
FUTURE_START_DATE = 00000000  
;// 版本类型_将来    
FUTURE_VERSION_TYPE = 1   

;=== 充值读写器主控程序版本 ===
[RECHARGE_RW_MAIN]
;// 版本号_当前
CURRENT_VERSION_NO =0  
;// 批次号_当前      
CURRENT_BATCH_NO   = 0  
;// 厂商ID_当前           
CURRENT_COMPANY_ID = 17 
;// 生效日期_当前           
CURRENT_START_DATE = 00000000  
;// 版本类型_当前    
CURRENT_VERSION_TYPE = 0    

;// 版本号_将来
FUTURE_VERSION_NO = 4294967295
;// 批次号_将来      
FUTURE_BATCH_NO   = 0  
;// 厂商ID_将来           
FUTURE_COMPANY_ID = 17 
;// 生效日期_将来           
FUTURE_START_DATE = 00000000  
;// 版本类型_将来    
FUTURE_VERSION_TYPE = 1   

;=== 票卡读写器应用程序版本 ===
[CARD_RW_APP]
;// 版本号_当前
CURRENT_VERSION_NO =0
;// 批次号_当前      
CURRENT_BATCH_NO   =0  
;// 厂商ID_当前           
CURRENT_COMPANY_ID =17 
;// 生效日期_当前           
CURRENT_START_DATE =20170609  
;// 版本类型_当前    
CURRENT_VERSION_TYPE =0    

;// 版本号_将来
FUTURE_VERSION_NO = 4294967295
;// 批次号_将来      
FUTURE_BATCH_NO   = 0  
;// 厂商ID_将来           
FUTURE_COMPANY_ID = 17 
;// 生效日期_将来           
FUTURE_START_DATE = 00000000  
;// 版本类型_将来    
FUTURE_VERSION_TYPE = 1   

;=== 票卡读写器主控程序版本 ===
[CARD_RW_MAIN]
;// 版本号_当前
CURRENT_VERSION_NO =0  
;// 批次号_当前      
CURRENT_BATCH_NO   = 0  
;// 厂商ID_当前           
CURRENT_COMPANY_ID = 17 
;// 生效日期_当前           
CURRENT_START_DATE = 00000000  
;// 版本类型_当前    
CURRENT_VERSION_TYPE = 0    

;// 版本号_将来
FUTURE_VERSION_NO = 4294967295
;// 批次号_将来      
FUTURE_BATCH_NO   = 0  
;// 厂商ID_将来           
FUTURE_COMPANY_ID = 17 
;// 生效日期_将来           
FUTURE_START_DATE = 00000000  
;// 版本类型_将来    
FUTURE_VERSION_TYPE = 1   

;=== TOKEN读写器应用程序版本 ===
[TOKEN_RW_APP]
;// 版本号_当前
CURRENT_VERSION_NO =0
;// 批次号_当前      
CURRENT_BATCH_NO   =0  
;// 厂商ID_当前           
CURRENT_COMPANY_ID =17
;// 生效日期_当前           
CURRENT_START_DATE =20111218  
;// 版本类型_当前    
CURRENT_VERSION_TYPE =0    

;// 版本号_将来
FUTURE_VERSION_NO = 4294967295
;// 批次号_将来      
FUTURE_BATCH_NO   = 0  
;// 厂商ID_将来           
FUTURE_COMPANY_ID = 17 
;// 生效日期_将来           
FUTURE_START_DATE = 00000000  
;// 版本类型_将来    
FUTURE_VERSION_TYPE = 1   

;=== TOKEN读写器主控程序版本 ===
[TOKEN_RW_MAIN]
;// 版本号_当前
CURRENT_VERSION_NO =0  
;// 批次号_当前      
CURRENT_BATCH_NO   = 0  
;// 厂商ID_当前           
CURRENT_COMPANY_ID = 17 
;// 生效日期_当前           
CURRENT_START_DATE = 00000000  
;// 版本类型_当前    
CURRENT_VERSION_TYPE = 0    

;// 版本号_将来
FUTURE_VERSION_NO = 4294967295
;// 批次号_将来      
FUTURE_BATCH_NO   = 0  
;// 厂商ID_将来           
FUTURE_COMPANY_ID = 17 
;// 生效日期_将来           
FUTURE_START_DATE = 00000000  
;// 版本类型_将来    
FUTURE_VERSION_TYPE = 1

;//声音文件
[VOICE_TYPE]
;// 版本号_当前
CURRENT_VERSION_NO =1 
;// 批次号_当前      
CURRENT_BATCH_NO   =0  
;// 厂商ID_当前           
CURRENT_COMPANY_ID =17 
;// 生效日期_当前           
CURRENT_START_DATE =20150327
;// 版本类型_当前    
CURRENT_VERSION_TYPE =0    

;// 版本号_将来
FUTURE_VERSION_NO =-1 
;// 批次号_将来      
FUTURE_BATCH_NO   =0  
;// 厂商ID_将来           
FUTURE_COMPANY_ID =17 
;// 生效日期_将来           
FUTURE_START_DATE =00000000  
;// 版本类型_将来    
FUTURE_VERSION_TYPE =1 
  
;//GUI文件
[GUI_TYPE]
;// 版本号_当前
CURRENT_VERSION_NO =111 
;// 批次号_当前      
CURRENT_BATCH_NO   =0  
;// 厂商ID_当前           
CURRENT_COMPANY_ID =17 
;// 生效日期_当前           
CURRENT_START_DATE =20170207
;// 版本类型_当前    
CURRENT_VERSION_TYPE =0    

;// 版本号_将来
FUTURE_VERSION_NO =-1 
;// 批次号_将来      
FUTURE_BATCH_NO   =0  
;// 厂商ID_将来           
FUTURE_COMPANY_ID =17 
;// 生效日期_将来           
FUTURE_START_DATE =00000000  
;// 版本类型_将来    
FUTURE_VERSION_TYPE =1   

;//模板文件
[TEMPLATE_TYPE]
;// 版本号_当前
CURRENT_VERSION_NO =1 
;// 批次号_当前      
CURRENT_BATCH_NO   =0  
;// 厂商ID_当前           
CURRENT_COMPANY_ID =17 
;// 生效日期_当前           
CURRENT_START_DATE =20150327
;// 版本类型_当前    
CURRENT_VERSION_TYPE =0    

;// 版本号_将来
FUTURE_VERSION_NO =-1 
;// 批次号_将来      
FUTURE_BATCH_NO   =0  
;// 厂商ID_将来           
FUTURE_COMPANY_ID =17 
;// 生效日期_将来           
FUTURE_START_DATE =00000000  
;// 版本类型_将来    
FUTURE_VERSION_TYPE =1;


;//线路站点参数文件
[STATION_MAP_TYPE]
;// 版本号_当前
CURRENT_VERSION_NO =1 
;// 批次号_当前      
CURRENT_BATCH_NO   =0  
;// 厂商ID_当前           
CURRENT_COMPANY_ID =17 
;// 生效日期_当前           
CURRENT_START_DATE =20170913
;// 版本类型_当前    
CURRENT_VERSION_TYPE =0    

;// 版本号_将来
FUTURE_VERSION_NO =-1 
;// 批次号_将来      
FUTURE_BATCH_NO   =0  
;// 厂商ID_将来           
FUTURE_COMPANY_ID =17 
;// 生效日期_将来           
FUTURE_START_DATE =00000000  
;// 版本类型_将来    
FUTURE_VERSION_TYPE =1
[RW_MAIN]
CURRENT_VERSION_NO=0
[RW_APP]
CURRENT_VERSION_NO=0
